#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>



//操作符
// 
// 
//算术操作符

//int main()
//{
//	int a = 6 / 5;
//	float a_1 = 6 / 5;
//	int a_2 = 6 %5;            //取模操作符的操作数必须为整数
//	float a_3 = 6 %5;
//
//	float a_4 = 6.0 / 5;
//
//	printf("%d\n%f\n%d\n%f\n%f\n", a,a_1,a_2,a_3,a_4);
//	return 0;
//}

//移位操作符
//int main()
//{
//	int a = -1;
//	//整数二进制表示形式：原码、反码、补码
//	// 原码：由数值直接写出的二进制序列
//	// 反码：原码的符号位不变，其他位取反
//	// 补码：反码+1
//	//内存中正整数--原码形式(正整数原码、反码、补码相同）；负整数--补码形式
//	//符号位是第一位，正整数为0，负整数为1
//
//
//	//算术移位
//	//左移操作符：左边丢弃，右边补0；向左移动一位<=>乘以2
//	//右移操作符：右边丢弃，左边补0；向右移动一位<=>除以2
//	
//	//把a的二进制位向左移动一位
//	int b = a << 1;
//	int c = a >> 1;
//	printf("%d\n%d\n%d\n", a, b,c);
//	return 0;
//}



//位操作符  &--按位与   |--按位或    ^--按位异或     操作数必须为整数
//int main()
//{
//	int a = 3, b = 5;
//	//二进制每一位进行与操作
//	int c = a & b;
//	//二进制每一位进行或操作
//	int d = a | b;
//	//二进制每一位进行异或操作(相同为0，相异为1）
//	int e = a ^ b;    //(c、c++中没有乘方运算符） 
//	printf("%d\n%d\n%d\n", c,d,e);
//	return 0;
//}



